<?php
// +----------------------------------------------------------------------
// | 文件说明：用户-导航
// +----------------------------------------------------------------------
// | Copyright (c) 2013-2017 http://www.thinkcmf.com All rights reserved.
// +----------------------------------------------------------------------
// | Author: duan
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Date: 2017-11-15
// +----------------------------------------------------------------------

namespace api\home\model;

use think\Model;

class NavMenuModel extends Model
{
    /**
     * [base 全局查询范围status=1显示状态]
     */
    protected function base($query)
    {
        $query->where('status', 1);
    }
}

